app/controllers/courses_controller.rb

  def create
    @course = Course.new(:name => params[:name], :size => params[:size], :credits => params[:credits], :professor_id => params[:professor_id])
    if @course.save
---
INSERT INTO "courses" ("name", "size", "credits", "professor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "MATH202"], ["size", 100], ["credits", 3], ["professor_id", 1], ["created_at", "2018-04-03 03:43:52.327499"], ["updated_at", "2018-04-03 03:43:52.327499"]]