app/controllers/meetings_controller.rb

INSERT INTO "meetings" ("mon_start", "mon_end", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["mon_start", "14:00:00"], ["mon_end", "16:00:00"], ["course_id", 1], ["created_at", "2018-04-03 03:52:33.785065"], ["updated_at", "2018-04-03 03:52:33.785065"]]
---
  def create
    new_params = params.delete_if{|k| k=="action" || k=="controller" || k=="meeting"}

    @meeting = Meeting.new(new_params)

    if @meeting.save