app/controllers/notifications_controller.rb

  def index

    if params[:unread] == "true"
      @notifications = Notification.where({user_id: params[:user_id], unread: true})
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1 AND "notifications"."unread" = $2  [["user_id", 1], ["unread", "t"]]

  def show
    @notification = Notification.find(params[:id])
---
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @notification = Notification.new(
      :user_id => params[:user_id],
      :registration_id => params[:registration_id],
      :unread => true,
      :message => params[:message],
      :course_id => params[:course_id],
      :student_id => params[:student_id],
      :professor_id => params[:professor_id],
      :status => params[:status]
    )

    if @notification.save
---
INSERT INTO "notifications" ("created_at", "updated_at", "student_id", "professor_id", "course_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2018-04-04 18:17:54.686561"], ["updated_at", "2018-04-04 18:17:54.686561"], ["student_id", 1], ["professor_id", 1], ["course_id", 1]]

  def edit

    @notification = Notification.find(params[:id])
---
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]