app/controllers/professors_controller.rb

SELECT "professors".* FROM "professors"
---
  def index

    puts("in prof index")
    @professors = Professor.all

INSERT INTO "professors" ("first_name", "last_name", "email", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "john"], ["last_name", "carter"], ["email", "jc@college.com"], ["user_id", 10], ["created_at", "2018-04-04 19:40:59.910722"], ["updated_at", "2018-04-04 19:40:59.910722"]]
---
  def new
    @professor = Professor.new({
      :first_name => params[:first_name],
      :last_name => params[:last_name],
      :email => params[:email],
      :user_id => params[:user_id]
      })
    if @professor.save