app/controllers/registrations_controller.rb

SELECT "registrations".* FROM "registrations"
---
  def index
    @registrations = Registration.all

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."user_id" = $1  [["user_id", 3]]
INSERT INTO "registrations" ("student_id", "course_id", "created_at", "updated_at", "professor_id", "status", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["student_id", 1], ["course_id", 1], ["created_at", "2018-04-04 20:09:14.905781"], ["updated_at", "2018-04-04 20:09:14.905781"], ["professor_id", 1], ["status", "pending"], ["user_id", 1]]
---
  def create
    if !User.find(params[:user_id]).is_professor
      @professor_id = Course.find_by_id(params[:course_id]).professor_id
      @student_id = Student.find_by(user_id: params[:user_id]).id
      @professor_user_id = Professor.find_by_id(@professor_id).user_id
      @message = "A student has registered for your class"
      @registration = Registration.new(:user_id => params[:user_id], :course_id => params[:course_id], :professor_id => @professor_id, :student_id => @student_id, :status => "pending")
      if @registration.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "registrations".* FROM "registrations" WHERE "registrations"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "registrations" SET "status" = $1, "updated_at" = $2 WHERE "registrations"."id" = $3  [["status", "approved"], ["updated_at", "2018-04-05 16:41:30.114864"], ["id", 5]]
---
  def update
    if User.find(params[:user_id]).is_professor
      if params[:status] == "approved"
        @message = "Your registration was approved"
      elsif params[:status] == "denied"
        @message = "Your registration was not approved"
      elsif params[:status] == "dropped"
        @message = "You have been dropped from this class"
      end
      @registration = Registration.find(params[:id])
      @notification_id = Notification.find_by(registration_id: @registration.id).id
      @registration.status = params[:status]
      if @registration.save