app/controllers/schedules_controller.rb

INSERT INTO "schedules" ("course_id", "student_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["course_id", 1], ["student_id", 1], ["created_at", "2018-04-03 23:34:12.893662"], ["updated_at", "2018-04-03 23:34:12.893662"]]
---
  def create
    @schedule = Schedule.new(:course_id => params[:course_id], :student_id => params[:student_id])

    if @schedule.save