app/controllers/schedules_controller.rb

  def index
    schedule = {}
    params_to_scrub = ["id", "mon_end", "course_id"]
    if !User.find(params[:user_id]).is_professor
      student_id = Student.where(:user_id => params[:user_id])
      registrations = Registration.where({student_id: student_id, status: "approved"})
      registrations.map do |ele|
        schedule[Course.find(ele[:course_id])[:name]] = Meeting.where(course_id: ele[:course_id]).to_a.map!{|ele| ele.as_json.except(*params_to_scrub)}
      end
    else
      professor_id = Professor.where(:user_id => params[:user_id])
      courses = Course.where({professor_id: professor_id})
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "registrations".* FROM "registrations" WHERE "registrations"."student_id" = $1 AND "registrations"."status" = $2  [["student_id", 1], ["status", "approved"]]
SELECT "meetings".* FROM "meetings" WHERE "meetings"."course_id" = $1  [["course_id", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new


    @schedule = Schedule.new(:course_id => params[:course_id], :user_id => params[:user_id])
    if @schedule.save
---
INSERT INTO "schedules" ("course_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["course_id", 1], ["created_at", "2018-04-08 22:08:55.973769"], ["updated_at", "2018-04-08 22:08:55.973769"], ["user_id", 1]]