app/controllers/students_controller.rb

  def new
    @student = Student.new({
      :first_name => params[:first_name],
      :last_name => params[:last_name],
      :year => params[:year],
      :email => params[:email],
      :user_id => params[:user_id]
      })
    if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "email", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "terry"], ["last_name", "bake"], ["email", "coryb08@yahoo.com"], ["created_at", "2018-04-04 18:46:59.237591"], ["updated_at", "2018-04-04 18:46:59.237591"], ["user_id", 6]]