app/controllers/users_controller.rb

INSERT INTO "users" ("is_professor", "first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["is_professor", "t"], ["first_name", "doug"], ["last_name", "bake"], ["email", "coryb08@yahoo.com"], ["created_at", "2018-04-02 20:17:50.003755"], ["updated_at", "2018-04-02 20:17:50.003755"]]
---
  def create
    @user = User.new({
      :is_professor => params[:is_professor],
      :first_name => params[:first_name],
      :last_name => params[:last_name],
      :year => params[:year],
      :email => params[:email]
      })
    if @user.save